Vile13/pqc-esp32s3-benchmarks/firmware/esp32s3-dut/sdkconfig.defaults
# Target and flash: ESP32-S3-DevKitC-1-N8R8, 8 MB quad flash
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# The default 1 MB app partition is too small once Wi-Fi, lwIP and the committed
# ACVP vectors are in the image. See partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Run at the rated clock. Benchmarks are reported in cycles, but a fixed and
# stated frequency keeps wall-clock figures comparable across runs.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_PM_ENABLE=n

# PSRAM: 8 MB octal, available to the application but NEVER to the crypto core.
#
# CAPS_ALLOC is the load-bearing setting here: plain malloc() keeps returning
# internal SRAM, and PSRAM is only reachable through an explicit
# heap_caps_malloc(..., MALLOC_CAP_SPIRAM). A stray allocation therefore cannot
# silently drift into slow external memory and corrupt a measurement.
# See docs/hardware.md.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# ML-KEM needs far more stack than the 3584-byte default. An ML-KEM-768 secret
# key alone is 2400 bytes, and the polynomial arithmetic adds several KB of
# temporaries on top. The default silently overflows.
#
# This is generous on purpose: it is the correctness build. Peak stack is a
# measured quantity in v2 (via high-water marks), not something to guess at by
# tuning this number down until it stops crashing.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768

# HKDF-SHA-256 for the protocol key schedule (docs/protocol.md). Off by default
# in ESP-IDF; enabled here rather than hand-rolling the construction.
CONFIG_MBEDTLS_HKDF_C=y

# Deterministic console for the measurement harness
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Keep the watchdog from firing during long crypto loops
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
